apache/nuttx/arch/risc-v/src/bl602/bl602_netdev.c
static mutex_t g_wifi_scan_lock = NXMUTEX_INITIALIZER;
static sem_t g_wifi_connect_sem = SEM_INITIALIZER(0);

/* Rx Pending List */

static struct list_node g_rx_pending;

/* Firmware default config */

static wifi_conf_t g_conf =
{
  .country_code = CONFIG_BL602_WIRELESS_CONTRY_CODE,
};

/* Global state */

static struct
{
  uint32_t scan_result_status : 2; /* WiFi scan result status */
  uint32_t scan_result_len : 6;
  uint32_t retry_cnt : 4; /* MAX 16 retries */
  uint32_t sta_connected: 1;
  uint32_t ap_stared: 1;
} g_state;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

extern int  bl_output(struct bl_hw *bl_hw, char *p, int tot_len, int is_sta);
extern void bl_free_rx_buffer(void *p);
extern void bl_irq_handler(void);
extern void wifi_main_init(void);
extern void ipc_emb_notify(void);
extern void wifi_mgmr_tsk_init(void);
extern int bl602_ef_ctrl_read_mac_address(uint8_t mac[6]);
extern void wifi_main(int argc, char *argv[]);
extern void wifi_mgmr_start_background(wifi_conf_t *conf);
extern int bl_pm_init(void);
extern struct net_device bl606a0_sta;

/* Common TX logic */

static int bl602_net_transmit(struct bl602_net_driver_s *priv);
static int bl602_net_txpoll(struct net_driver_s *dev);

/* Interrupt handling */

static void bl602_net_reply(struct bl602_net_driver_s *priv);
static void bl602_net_receive(struct bl602_net_driver_s *priv);

/* NuttX callback functions */

static int bl602_net_ifup(struct net_driver_s *dev);
static int bl602_net_ifdown(struct net_driver_s *dev);

static void bl602_net_txavail_work(void *arg);
static int  bl602_net_txavail(struct net_driver_s *dev);

#if defined(CONFIG_NET_MCASTGROUP) || defined(CONFIG_NET_ICMPv6)
static int bl602_net_addmac(struct net_driver_s *dev,
                            const uint8_t *mac);
#  ifdef CONFIG_NET_MCASTGROUP
static int bl602_net_rmmac(struct net_driver_s *dev,
                           const uint8_t *mac);
#  endif
#endif

#ifdef CONFIG_NETDEV_IOCTL
static int
bl602_net_ioctl(struct net_driver_s *dev, int cmd, unsigned long arg);
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bl602_net_transmit
 *
 * Description:
 *   Start hardware transmission.  Called either from the txdone interrupt
 *   handling or from watchdog based polling.
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int bl602_net_transmit(struct bl602_net_driver_s *priv)
{
  int ret = OK;
  ninfo("tx pkt len:%d\n", priv->net_dev.d_len);

  DEBUGASSERT(priv->net_dev.d_len <= WIFI_MTU_SIZE);
  DEBUGASSERT(priv->push_cnt < BL602_TXDESC_THRESHOLD);

  if (!IFF_IS_RUNNING(priv->net_dev.d_flags))
    {
      nwarn("drop packet due to iface no carrier\n");
      bl602_netdev_free_txbuf(priv->net_dev.d_buf -
                              PRESERVE_80211_HEADER_LEN);
      priv->net_dev.d_buf = NULL;

      return -EPERM;
    }

  DEBUGASSERT(priv->wlan != NULL);

  /* Increment statistics */

  NETDEV_TXPACKETS(priv->net_dev);

  bl_output(bl606a0_sta.bl_hw,
            (char *)priv->net_dev.d_buf,
            priv->net_dev.d_len,
            0 == priv->wlan->mode);

  priv->push_cnt++;

  if (priv->push_cnt == BL602_TXDESC_THRESHOLD)
    {
      /* notify to tx now */

      bl_irq_handler();
      priv->push_cnt = 0;
    }

  priv->net_dev.d_buf = NULL;

  return ret;
}

/****************************************************************************
 * Name: bl602_net_txpoll
 *
 * Description:
 *   The transmitter is available, check if the network has any outgoing
 *   packets ready to send.  This is a callback from devif_poll().
 *   devif_poll() may be called:
 *
 *   1. When the preceding TX packet send is complete,
 *   2. When the preceding TX packet send timesout and the interface is reset
 *   3. During normal TX polling
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int bl602_net_txpoll(struct net_driver_s *dev)
{
  struct bl602_net_driver_s *priv =
    (struct bl602_net_driver_s *)dev->d_private;

  /* Send the packet */

  bl602_net_transmit(priv);

  /* Check if there is room in the device to hold another packet.
   * If not, return a non-zero value to terminate the poll.
   */

  priv->net_dev.d_buf = bl602_netdev_alloc_txbuf();
  if (priv->net_dev.d_buf)
    {
      priv->net_dev.d_buf += PRESERVE_80211_HEADER_LEN;
      priv->net_dev.d_len = 0;
    }

  return priv->net_dev.d_buf == NULL;
}

/****************************************************************************
 * Name: bl602_net_reply
 *
 * Description:
 *   After a packet has been received and dispatched to the network, it
 *   may return return with an outgoing packet.  This function checks for
 *   that case and performs the transmission if necessary.
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static void bl602_net_reply(struct bl602_net_driver_s *priv)
{
  uint8_t *tx_p = NULL;

  /* If the packet dispatch resulted in data that should be sent out on the
   * network, the field d_len will set to a value > 0.
   */

  if (priv->net_dev.d_len > 0)
    {
      /* alloc tx buffer and copy to it */

