apache/nuttx/arch/risc-v/src/bl602/bl602_netdev.c
  if (work_available(&priv->availwork))
    {
      /* Schedule to serialize the poll on the worker thread. */

      work_queue(ETHWORK, &priv->availwork, bl602_net_txavail_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: bl602_net_addmac
 *
 * Description:
 *   NuttX Callback: Add the specified MAC address to the hardware multicast
 *   address filtering
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   mac  - The MAC address to be added
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

#if defined(CONFIG_NET_MCASTGROUP) || defined(CONFIG_NET_ICMPv6)
static int bl602_net_addmac(struct net_driver_s *dev,
                            const uint8_t *mac)
{
  struct bl602_net_driver_s *priv =
    (struct bl602_net_driver_s *)dev->d_private;

  /* Add the MAC address to the hardware multicast routing table */

  return OK;
}
#endif

/****************************************************************************
 * Name: bl602_net_rmmac
 *
 * Description:
 *   NuttX Callback: Remove the specified MAC address from the hardware
 *   multicast address filtering
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   mac  - The MAC address to be removed
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

#ifdef CONFIG_NET_MCASTGROUP
static int bl602_net_rmmac(struct net_driver_s *dev,
                           const uint8_t *mac)
{
  struct bl602_net_driver_s *priv =
    (struct bl602_net_driver_s *)dev->d_private;

  /* Add the MAC address to the hardware multicast routing table */

  return OK;
}
#endif

static void scan_complete_indicate(void *data, void *param)
{
  int                        i;
  struct scan_parse_param_s *para;
  wifi_mgmr_scan_item_t     *scan;

  para = (struct scan_parse_param_s *)data;
  DEBUGASSERT(para != NULL);
  DEBUGASSERT(para->priv != NULL);
  g_state.scan_result_len = 0;

  for (i = 0;
       i < sizeof(WIFI_MGMR.scan_items) / sizeof(WIFI_MGMR.scan_items[0]);
       i++)
    {
      scan = &WIFI_MGMR.scan_items[i];

      if (wifi_mgmr_scan_item_is_timeout(&WIFI_MGMR,
                                         &(WIFI_MGMR.scan_items[i])))
        {
          scan->is_used = 0;
        }
      else if (scan->is_used)
        {
          if (para->priv->channel != 0 &&
              scan->channel != para->priv->channel)
            {
              scan->is_used = 0;
            }
          else if (para->flags & IW_SCAN_THIS_ESSID)
            {
              if (strncmp(scan->ssid,
                          (char *)para->scan_req.essid,
                          sizeof(scan->ssid)) == 0)
                {
                  scan->is_used = 1;
                  g_state.scan_result_len++;
                }
              else
                {
                  scan->is_used = 0;
                }
            }
          else
            {
              g_state.scan_result_len++;
            }
        }
    }

  kmm_free(data);
}

static int rssi_compare(const void *arg1, const void *arg2)
{
  wifi_mgmr_scan_item_t *item1 = &WIFI_MGMR.scan_items[*(uint8_t *)arg1];
  wifi_mgmr_scan_item_t *item2 = &WIFI_MGMR.scan_items[*(uint8_t *)arg2];

  return item1->rssi - item2->rssi;
}

static int format_scan_result_to_wapi(struct iwreq *req, int result_cnt)
{
  int      i = 0;
  int      j = 0;
  int      event_buff_len = 0;
  uint8_t *curr_pos       = NULL;

  uint8_t *rssi_list = NULL; /* for sort */

  if (result_cnt == 0)
    {
      return OK;
    }

  /* More compact arrangement */

  event_buff_len = result_cnt *
    (offsetof(struct iw_event, u) * 4 + sizeof(struct sockaddr) +
    sizeof(struct iw_freq) + sizeof(struct iw_quality) +
    sizeof(struct iw_point) + IW_ESSID_MAX_SIZE);

  if (req->u.data.length == 0 || req->u.data.length < event_buff_len)
    {
      return -E2BIG;
    }

  req->u.data.length = event_buff_len;

  /* alloc rssi list */

  rssi_list = kmm_malloc(result_cnt * sizeof(uint8_t));
  if (rssi_list == NULL)
    {
      return -ENOMEM;
    }

  /* record all valid scan result items */

  for (i = 0, j = 0;
       i < sizeof(WIFI_MGMR.scan_items) / sizeof(WIFI_MGMR.scan_items[0]);
       i++)
    {
      wifi_mgmr_scan_item_t *scan = &WIFI_MGMR.scan_items[i];

      if (scan->is_used == 0)
        {
          continue;
        }

      rssi_list[j++] = i;
    }

  DEBUGASSERT(j == result_cnt);

  /* sort the valid list according the rssi */

  qsort(rssi_list, result_cnt, sizeof(uint8_t), rssi_compare);

  /* construct iw event buffer */

  curr_pos = req->u.data.pointer;
  DEBUGASSERT(curr_pos != NULL);
  DEBUGASSERT(((uintptr_t)curr_pos & 0x3) == 0);

  for (i = 0; i < result_cnt; i++)
    {
      int                    idx  = rssi_list[i];
      wifi_mgmr_scan_item_t *scan = &WIFI_MGMR.scan_items[idx];

      struct iw_event *iwe;

      iwe = (struct iw_event *)curr_pos;
      DEBUGASSERT(((uintptr_t)iwe & 0x3) == 0);
      iwe->len = offsetof(struct iw_event, u) + sizeof(struct sockaddr);
      iwe->cmd = SIOCGIWAP;
      memcpy(iwe->u.ap_addr.sa_data, scan->bssid, sizeof(struct ether_addr));

      iwe = (struct iw_event *)((uintptr_t)iwe + iwe->len);
      DEBUGASSERT(((uintptr_t)iwe & 0x3) == 0);
      iwe->len      = offsetof(struct iw_event, u) + sizeof(struct iw_freq);
      iwe->cmd      = SIOCGIWFREQ;
      iwe->u.freq.e = 0;
      iwe->u.freq.m = scan->channel;

      iwe = (struct iw_event *)((uintptr_t)iwe + iwe->len);
      DEBUGASSERT(((uintptr_t)iwe & 0x3) == 0);
      iwe->len = offsetof(struct iw_event, u) + sizeof(struct iw_quality);
      iwe->cmd = IWEVQUAL;
      iwe->u.qual.level   = scan->rssi;
      iwe->u.qual.updated = IW_QUAL_DBM;

      iwe = (struct iw_event *)((uintptr_t)iwe + iwe->len);
      DEBUGASSERT(((uintptr_t)iwe & 0x3) == 0);
      iwe->len = offsetof(struct iw_event, u) + sizeof(struct iw_point) +
                 IW_ESSID_MAX_SIZE;
      iwe->cmd            = SIOCGIWESSID;
      iwe->u.essid.length = strlen(scan->ssid);
      iwe->u.essid.flags  = 1;

      /* refer:wapi wireless.c:272 */

