apache/nuttx/arch/risc-v/src/bl602/bl602_netdev.c
      iwe->u.essid.pointer = (void *)(uintptr_t)sizeof(struct iw_point);

      memcpy((uint8_t *)iwe + offsetof(struct iw_event, u) +
               sizeof(struct iw_point),
             scan->ssid,
             IW_ESSID_MAX_SIZE);

      curr_pos = (uint8_t *)(uintptr_t)iwe + iwe->len;
    }

  kmm_free(rssi_list);

  return OK;
}

static wifi_mgmr_t *
bl602_netdev_get_wifi_mgmr(struct bl602_net_driver_s *priv)
{
  if (priv->current_mode == IW_MODE_INFRA)
    {
      return container_of(priv->wlan, wifi_mgmr_t, wlan_sta);
    }
  else if (priv->current_mode == IW_MODE_MASTER)
    {
      return container_of(priv->wlan, wifi_mgmr_t, wlan_ap);
    }
  else
    {
      return NULL;
    }
}

#ifdef CONFIG_NETDEV_IOCTL
static int bl602_ioctl_wifi_start(struct bl602_net_driver_s *priv,
                                  uintptr_t                      arg)
{
  UNUSED(arg);

  /* perform connect ap */

  wifi_mgmr_t *mgmr = bl602_netdev_get_wifi_mgmr(priv);
  if (mgmr == NULL)
    {
      return -EPERM;
    }

  if (priv->current_mode == IW_MODE_INFRA)
    {
      int state;

      if (g_state.sta_connected == 1)
        {
          return OK;
        }

      priv->prev_connectd = 0;
      g_state.retry_cnt = 0;

      wifi_mgmr_sta_autoconnect_enable();
      if (wifi_mgmr_sta_connect(NULL, mgmr->wifi_mgmr_stat_info.ssid,
                                mgmr->wifi_mgmr_stat_info.passphr,
                                NULL,
                                (uint8_t *)priv->bssid,
                                0,
                                priv->channel) == -1)
        {
          return -EPIPE;
        }

      nxsem_wait(&g_wifi_connect_sem);

      /* check connect state */

      wifi_mgmr_state_get_internal(&state);
      if (state != WIFI_STATE_CONNECTED_IP_GOT)
        {
          return -EPIPE;
        }
    }
  else if (priv->current_mode == IW_MODE_MASTER)
    {
      int channel;

      if (g_state.ap_stared == 1)
        {
          return OK;
        }

      wifi_mgmr_channel_get(&channel);
      wlinfo("AP channel:%d\n", channel);

      if (wifi_mgmr_api_ap_start(mgmr->wifi_mgmr_stat_info.ssid,
                                 mgmr->wifi_mgmr_stat_info.passphr,
                                 channel ? channel : 1,
                                 0) < 0)
        {
          return -EPIPE;
        }
    }
  else
    {
      return -ENOSYS;
    }

  return OK;
}

static int bl602_ioctl_wifi_stop(struct bl602_net_driver_s *priv,
                                 uintptr_t                      arg)
{
  UNUSED(arg);

  /* perform disconnect */

  if (priv->current_mode == IW_MODE_INFRA)
    {
      if (g_state.sta_connected == 0)
        {
          return OK;
        }

      wifi_mgmr_sta_disconnect();
      nxsched_sleep(1);
      wifi_mgmr_api_idle();
    }
  else if (priv->current_mode == IW_MODE_MASTER)
    {
      if (g_state.ap_stared == 0)
        {
          return OK;
        }

      wifi_mgmr_api_ap_stop();
      nxsched_sleep(1);
      wifi_mgmr_api_idle();
    }

  return OK;
}

/****************************************************************************
 * Name: bl602_net_ioctl
 *
 * Description:
 *   Handle network IOCTL commands directed to this device.
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *   cmd - The IOCTL command
 *   arg - The argument for the IOCTL command
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int
bl602_net_ioctl(struct net_driver_s *dev, int cmd, unsigned long arg)
{
  struct bl602_net_driver_s *priv =
    (struct bl602_net_driver_s *)dev->d_private;
  int ret = -ENOSYS;

  /* Decode and dispatch the driver-specific IOCTL command */

  switch (cmd)
    {
    case SIOCSIWSCAN:
      do
        {
          struct iwreq              *req  = (struct iwreq *)arg;
          struct scan_parse_param_s *para = NULL;

          para = kmm_malloc(sizeof(struct scan_parse_param_s));
          if (para == NULL)
            {
              return -ENOMEM;
            }

          para->priv = priv;
          if (req->u.data.flags)
            {
              if (req->u.data.pointer == NULL)
                {
                  kmm_free(para);
                  return -EINVAL;
                }

              para->flags = req->u.data.flags;
              para->scan_req = *(struct iw_scan_req *)req->u.data.pointer;
            }
          else
            {
              para->flags = 0;
            }

          if (nxmutex_trylock(&g_wifi_scan_lock) == 0)
            {
              if (priv->channel != 0)
                {
                  const char *ssid = para->flags & IW_SCAN_THIS_ESSID ?
                    (char *)para->scan_req.essid : NULL;
                  wifi_mgmr_scan_adv(para, scan_complete_indicate,
                      &priv->channel, 1, ssid);
                }
              else
                {
                  const char *ssid = para->flags & IW_SCAN_THIS_ESSID ?
                    (char *)para->scan_req.essid : NULL;
                  wifi_mgmr_scan_adv(para, scan_complete_indicate,
                      NULL, 0, ssid);
                }

              return OK;
            }
          else
            {
              kmm_free(para);
              return -EBUSY;
            }
        }
      while (0);
      break;

    case SIOCGIWSCAN:
      do
        {
          struct iwreq *req = (struct iwreq *)arg;

          nxmutex_lock(&g_wifi_scan_lock);

          if (g_state.scan_result_status != 0)
            {
              wlwarn("scan failed\n");
              nxmutex_unlock(&g_wifi_scan_lock);
              return -EIO;
            }

          if (g_state.scan_result_len == 0)
            {
              req->u.data.length = 0;
              nxmutex_unlock(&g_wifi_scan_lock);
              return OK;
            }

          ret = format_scan_result_to_wapi(req, g_state.scan_result_len);
          nxmutex_unlock(&g_wifi_scan_lock);
          return ret;
        }
      while (0);
      break;

    case SIOCSIFHWADDR: /* Set device MAC address */
      return -ENOSYS;
      break;

    case SIOCSIWAUTH:
      /* FIXME not support set auth param now, return OK to support
       * wapi reconnect command
       */

      return OK;
      break;

    case SIOCSIWENCODEEXT: /* Set psk */
      do
        {
          struct iwreq         *req        = (struct iwreq *)arg;
          struct iw_encode_ext *ext        = req->u.encoding.pointer;
          char                 *passphrase = kmm_malloc(ext->key_len + 1);
          if (passphrase == NULL)
            {
              return -ENOMEM;
            }

          strlcpy(passphrase, (char *)ext->key, ext->key_len + 1);

