apache/nuttx/arch/risc-v/src/bl602/bl602_netdev.c
          wifi_mgmr_sta_passphr_set(passphrase);
          kmm_free(passphrase);
          return OK;
        }
      while (0);
      break;

    case SIOCSIWFREQ: /* Set channel/frequency (Hz) */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;

          if (req->u.freq.e != 0)
            {
              return -EINVAL;
            }

          priv->channel = req->u.freq.m;

          wlinfo("set channel to %d\n", priv->channel);

          return OK;
        }
      while (0);
      break;

    case SIOCGIWFREQ: /* Get channel/frequency (Hz) */
      wlwarn("WARNING: SIOCGIWFREQ not implemented\n");
      ret = -ENOSYS;
      break;

    case SIOCSIWMODE: /* Set operation mode */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;
#ifdef CONFIG_BL602_NET_MULTI_INTERFACE
          int interface_idx = priv - g_bl602_net;

          DEBUGASSERT(interface_idx >= 0 &&
              interface_idx < BL602_NET_NINTERFACES);
#endif

          if (req->u.mode == priv->current_mode)
            {
              wlinfo("mode not change\n");
              return OK;
            }

          if (req->u.mode == IW_MODE_INFRA)
            {
              /* station */

#ifdef CONFIG_BL602_NET_MULTI_INTERFACE
              if (interface_idx != 0)
                {
                  wlwarn("The interface does not support this mode.\n");
                  return -ENOSYS;
                }
#endif

              priv->wlan = wifi_mgmr_sta_enable(priv);

              memcpy(priv->wlan->mac,
                     priv->net_dev.d_mac.ether.ether_addr_octet,
                     6);
              wlinfo("now in station mode\n");
              priv->current_mode = IW_MODE_INFRA;
              return OK;
            }
          else if (req->u.mode == IW_MODE_MASTER)
            {
              /* AP Mode */

#ifdef CONFIG_BL602_NET_MULTI_INTERFACE
              if (interface_idx != 1)
                {
                  wlwarn("The interface does not support this mode.\n");
                  return -ENOSYS;
                }
#endif

              priv->wlan = wifi_mgmr_ap_enable(priv);
              memcpy(priv->wlan->mac,
                     priv->net_dev.d_mac.ether.ether_addr_octet,
                     6);
              wlinfo("now in ap state\n");
              priv->current_mode = IW_MODE_MASTER;
              return OK;
            }
          else
            {
              wlwarn("WARNING: Unsupported mode:%ld\n", req->u.mode);
              return -ENOSYS;
            }
        }
      while (0);
      break;

    case SIOCGIWMODE: /* Get operation mode */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;
          req->u.mode       = priv->current_mode;
          return OK;
        }
      while (0);
      break;

    case SIOCSIWAP: /* Set access point MAC addresses */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;
          if (priv->current_mode == IW_MODE_INFRA)
            {
              /* Set bssid */

              memcpy(
                priv->bssid, req->u.ap_addr.sa_data, sizeof(priv->bssid));
              wlinfo("ap bssid:%s\n", priv->bssid);
            }
          else if (priv->current_mode == IW_MODE_MASTER)
            {
              bl_wifi_ap_mac_addr_set((uint8_t *)req->u.ap_addr.sa_data);
            }
          else
            {
              return -ENOSYS;
            }

          return OK;
        }
      while (0);
      break;

    case SIOCGIWAP: /* Get access point MAC addresses */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;
          if (priv->current_mode == IW_MODE_INFRA)
            {
              /* Get bssid */

              memcpy(req->u.ap_addr.sa_data,
                     priv->bssid,
                     sizeof(req->u.ap_addr.sa_data));
            }
          else if (priv->current_mode == IW_MODE_MASTER)
            {
              bl_wifi_ap_mac_addr_get((uint8_t *)req->u.ap_addr.sa_data);
            }

          return OK;
        }
      while (0);
      break;

    case SIOCSIWESSID: /* Set ESSID (network name) */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;

          wifi_mgmr_sta_ssid_set(req->u.essid.pointer);

          wlinfo("essid: %s\n", (char *)req->u.essid.pointer);

          if (req->u.essid.flags == 0)
            {
              return bl602_ioctl_wifi_stop(priv, arg);
            }
          else if (req->u.essid.flags == 1)
            {
              return bl602_ioctl_wifi_start(priv, arg);
            }
          else
            {
              wlinfo("unknown essid action: %d\n", req->u.essid.flags);
              return -ENOSYS;
            }
        }
      while (0);
      break;

    case SIOCGIWESSID: /* Get ESSID */
      do
        {
          struct iwreq *req  = (struct iwreq *)arg;
          wifi_mgmr_t * mgmr = bl602_netdev_get_wifi_mgmr(priv);
          int           length;

          DEBUGASSERT(req->u.essid.length > 0);
          DEBUGASSERT(req->u.essid.pointer != NULL);

          if (mgmr == NULL)
            {
              *(uint8_t *)req->u.essid.pointer = 0;

              return OK;
            }

          length = strlen(mgmr->wifi_mgmr_stat_info.ssid) + 1;
          length =
            length > req->u.essid.length ? req->u.essid.length : length;

          memcpy(
            req->u.essid.pointer, mgmr->wifi_mgmr_stat_info.ssid, length);

          return OK;
        }
      while (0);
      break;

    case SIOCSIWRATE: /* Set default bit rate (bps) */
      wlwarn("WARNING: SIOCSIWRATE not implemented\n");
      ret = -ENOSYS;
      break;

    case SIOCGIWRATE: /* Get default bit rate (bps) */
      wlwarn("WARNING: SIOCGIWRATE not implemented\n");
      ret = -ENOSYS;
      break;

    case SIOCSIWTXPOW: /* Set transmit power (dBm) */
      wlwarn("WARNING: SIOCSIWTXPOW not implemented\n");
      ret = -ENOSYS;
      break;

    case SIOCGIWTXPOW: /* Get transmit power (dBm) */
      wlwarn("WARNING: SIOCGIWTXPOW not implemented\n");
      ret = -ENOSYS;
      break;

