apache/nuttx/arch/risc-v/src/bl602/bl602_netdev.c
  list_initialize(&g_rx_pending);

  /* Start wifi process */

  wifi_manager_process(0, NULL);

  /* Read the MAC address from the hardware into
   * priv->net_dev.d_mac.ether.ether_addr_octet
   * Applies only if the Wireless MAC has its own internal address.
   */

  bl602_efuse_read_mac_address(mac);
  wlinfo(":::MAC:%x %x %x %x %x %x\n",
         mac[0],
         mac[1],
         mac[2],
         mac[3],
         mac[4],
         mac[5]);

  for (idx = 0; idx < BL602_NET_NINTERFACES; idx++)
    {
      /* Get the interface structure associated with this interface number. */

      priv = &g_bl602_net[idx];

      /* Initialize the driver structure */

      memset(priv, 0, sizeof(struct bl602_net_driver_s));
      priv->net_dev.d_ifup =
        bl602_net_ifup; /* I/F up (new IP address) callback */

      priv->net_dev.d_ifdown  = bl602_net_ifdown;  /* I/F down callback */
      priv->net_dev.d_txavail = bl602_net_txavail; /* New TX data callback */
#ifdef CONFIG_NET_MCASTGROUP
      priv->net_dev.d_addmac = bl602_net_addmac; /* Add multicast MAC address */
      priv->net_dev.d_rmmac  = bl602_net_rmmac;  /* Remove multicast MAC address */
#endif
#ifdef CONFIG_NETDEV_IOCTL
      priv->net_dev.d_ioctl = bl602_net_ioctl; /* Handle network IOCTL commands */
#endif
      priv->net_dev.d_private = priv; /* Used to recover private state from dev */
      priv->net_dev.d_pktsize =
        BL602_NET_TXBUFF_SIZE - PRESERVE_80211_HEADER_LEN;

#ifdef CONFIG_BL602_NET_MULTI_INTERFACE
      /* Set AP's MAC address equals STA's MAC */

      memcpy(priv->net_dev.d_mac.ether.ether_addr_octet, mac, 6);

      if (idx == 0)
        {
          bl_wifi_sta_mac_addr_set(
              priv->net_dev.d_mac.ether.ether_addr_octet);
        }
      else
        {
          bl_wifi_ap_mac_addr_set(
              priv->net_dev.d_mac.ether.ether_addr_octet);
        }
#else
      DEBUGASSERT(idx == 0);

      memcpy(priv->net_dev.d_mac.ether.ether_addr_octet, mac, 6);
      bl_wifi_sta_mac_addr_set(priv->net_dev.d_mac.ether.ether_addr_octet);
      bl_wifi_ap_mac_addr_set(priv->net_dev.d_mac.ether.ether_addr_octet);
#endif

      /* Enable scan hidden SSID */

      wifi_mgmr_scan_filter_hidden_ssid(0);

      priv->current_mode = IW_MODE_AUTO;

      /* Register the device with the OS so that socket IOCTLs can be
       * performed
       */

      return netdev_register(&priv->net_dev, NET_LL_IEEE80211);
    }

  return OK;
}

#endif /* CONFIG_NET_BL602_NETDEV */
